Revit 2024 API
ViewDisplaySketchyLines.EnableSketchyLines Property
 True to enable sketchy lines visibility. False to disable it.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public bool EnableSketchyLines { get; set; }
Visual Basic
Public Property EnableSketchyLines As Boolean
	Get
	Set
Visual C++
public:
property bool EnableSketchyLines {
	bool get ();
	void set (bool value);
}
See Also
ViewDisplaySketchyLines Class
Autodesk.Revit.DB Namespace